12/data/attachments/67b717e5a999ba7c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_3754447f-dfc3-47cd-b37d-4449d64219da</nif:username>
            <nif:friendToBeAdded>Jesse_long_Friend_18558_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>